/**
 * Created by tonyguan on 2014/8/22.
 */

var a = 178;       //二進位10110010;
var b = 94;      //二進位01011110;

console.log("a | b = " + (a | b)); 		//二進位11111110
console.log("a & b = " + (a & b)); 	//二進位00010010
console.log("a ^ b = " + (a ^ b)); 	//二進位11101100
console.log("~a = " + (~a));      	//二進位11111111 11111111 11111111 01001101 ，十進位 -179

console.log("a >> 2 = " + (a >> 2));  //二進位00101100
console.log("a >>> 2 = " + (a >>> 2));  //二進位00101100
console.log("a << 2 = " + (a << 2));  //二進位11001000

var c = -12;           //-1100;
console.log("c >> 2 = " + (c >> 2));  //二進位-00000011
console.log("c >>> 2 = " + (c >>> 2));  //十進位1073741821
console.log("c << 2 = " + (c << 2)); //二進位-00110000
